....+.*..1....+....2....+....3....+....4....+....5....+....6....+....7..
      *A   B

       id division.
          program-id. hello.
          author. Soldier of COBOL.

       environment division.
       
       data division.
       
       procedure division.
           display 'Hello COBOL'
           stop run.

....+.*..1....+....2....+....3....+....4....+....5....+....6....+....7..
